In [2]:
import pandas as pd

In [3]:
import numpy as np

## map 메소드는 두 개의 경우에 처리가 다르다.

    인덱스일 경우는 함수 등을 넣어서 변경하고
    시리즈는 다른 시리즈의 인덱스와 매핑된 값을 변경한다.

## Index class의 map 메소드

    인자로 함수 등 호출 가능한 것을 넣어서 내부적으로 실행해서 처리된 결과룰 받는다.

In [6]:
data = pd.DataFrame(np.arange(12).reshape((3,4)), index=['Ohio','Colorado','New York'],
                    columns=['one','two','three','four'])

In [7]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [9]:
help(data.index.map)

Help on method map in module pandas.core.indexes.base:

map(mapper) method of pandas.core.indexes.base.Index instance
    Apply mapper function to an index.

    Parameters
    ----------
    mapper : callable
        Function to be applied.

    Returns
    -------
    applied : Union[Index, MultiIndex], inferred
        The output of the mapping function applied to the index.
        If the function returns a tuple with more than one element
        a MultiIndex will be returned.

In [8]:
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [16]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

## 실제 변경하려면 대체처리한다.

In [17]:
data.index = data.index.map(str.upper)

In [18]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

## 인덱스를 변경한 새로운 데이터 프레임을 생성하기

### 기존 인덱스의 대소문자만 바꾸기

In [21]:
a = data.rename(index=str.title, columns=str.upper)

In [22]:
a

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

### 다른 이름으로 바꾸기

In [23]:
b = data.rename(index={'OHIO':'INDIANA'}, columns={'three':'peekaboo'})

In [24]:
b

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

###  내부 데이터를 갱신하기

In [25]:
b.rename(index= {"COLORADO": "MiSGAN"}, inplace=True)

In [26]:
b

          one  two  peekaboo  four
INDIANA     0    1         2     3
MiSGAN      4    5         6     7
NEW YORK    8    9        10    11

## Series class 의 map

   값과 인덱스가 매칭되는 경우에 값을 변경해 준다.

In [13]:
help(s.map)

Help on method map in module pandas.core.series:

map(arg, na_action=None) method of pandas.core.series.Series instance
    Map values of Series using input correspondence (which can be
    a dict, Series, or function)

    Parameters
    ----------
    arg : function, dict, or Series
    na_action : {None, 'ignore'}
        If 'ignore', propagate NA values, without passing them to the
        mapping function

    Returns
    -------
    y : Series
        same index as caller

    Examples
    --------

    Map inputs to outputs (both of type `Series`)

    >>> x = pd.Series([1,2,3], index=['one', 'two', 'three'])
    >>> x
    one      1
    two      2
    three    3
    dtype: int64

    >>> y = pd.Series(['foo', 'bar', 'baz'], index=[1,2,3])
    >>> y
    1    foo
    2    bar
    3    baz

    >>> x.map(y)
    one   foo
    two   bar
    three baz

    If `arg` is a dictionary, return a new Series with values converted
    according to the dictionary's mapping:

    >>> z = {1: 'A', 2: 'B', 3: 'C'}

    >>> x.map(z)
    one   A
    two   B
    three C

    Use na_action to control whether NA values are affected by the mapping
    function.

    >>> s = pd.Series([1, 2, 3, np.nan])

    >>> s2 = s.map('this is a string {}'.format, na_action=None)
    0    this is a string 1.0
    1    this is a string 2.0
    2    this is a string 3.0
    3    this is a string nan
    dtype: object

    >>> s3 = s.map('this is a string {}'.format, na_action='ignore')
    0    this is a string 1.0
    1    this is a string 2.0
    2    this is a string 3.0
    3                     NaN
    dtype: object

    See Also
    --------
    Series.apply: For applying more complex functions on a Series
    DataFrame.apply: Apply a function row-/column-wise
    DataFrame.applymap: Apply a function elementwise on a whole DataFrame

    Notes
    -----
    When `arg` is a dictionary, values in Series that are not in the
    dictionary (as keys) are converted to ``NaN``. However, if the
    dictionary is a ``dict`` subclass that defines ``__missing__`` (i.e.
    provides a method for default values), then this default is used
    rather than ``NaN``:

    >>> from collections import Counter
    >>> counter = Counter()
    >>> counter['bar'] += 1
    >>> y.map(counter)
    1    0
    2    1
    3    0
    dtype: int64

In [11]:
s = pd.Series([1,2,3,4], index=['a','b','c','d'])

In [14]:
y = pd.Series(['foo', 'bar', 'baz','boo'], index=[1,2,3,4])

In [15]:
s.map(y)

a    foo
b    bar
c    baz
d    boo
dtype: object